trade/src/InformationRegisters/КонтрольОтраженияВУчетеЭДО/КонтрольОтраженияВУчетеЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольОтраженияВУчетеЭДО</name>
  <resources>
    <name>СопоставитьНоменклатуру</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СоздатьУчетныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПровестиУчетныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DocumentRef.ЭлектронныйДокументВходящийЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/КонтрольОтраженияВУчетеЭДО/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль набора записей регистра сведений КонтрольОтраженияВУчетеЭДО
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоУдалениеНабораЗаписей(ЭтотОбъект, Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	НаУдаление = Новый Массив;
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не (Запись.СоздатьУчетныйДокумент Или Запись.ПровестиУчетныйДокумент) Тогда
			Запись.СопоставитьНоменклатуру = Ложь;
		КонецЕсли;
		
		Если Не (Запись.СопоставитьНоменклатуру
			Или Запись.СоздатьУчетныйДокумент
			Или Запись.ПровестиУчетныйДокумент) Тогда
			
			НаУдаление.Добавить(Запись);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Запись Из НаУдаление Цикл
		Удалить(Запись);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли
